---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireMaterialType.Name
source: html/93aaef5d-baa6-f731-46d9-e5a5cbb857bb.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialType.Name Property

Get name of wire material type.

## Syntax (C#)
```csharp
public override string Name { set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Set name can't be supported.